# Zsh 主题仓库
tap "romkatv/powerlevel10k"
# 带语法高亮的 cat 替代品
brew "bat"
brew "difftastic"
# 带图标的 ls 现代化替代品
brew "eza"
# 实现terminal启动的欢迎展示
brew "fastfetch"
# Google Gemini 终端助手
brew "gemini-cli"
# Docker 交互式终端界面
brew "lazydocker"
# Git 交互式终端界面
brew "lazygit"
# 主编辑器
brew "neovim"
# 极速 Zsh 主题
brew "powerlevel10k"
# 高速搜索，neovim grep 依赖
brew "ripgrep"
# 实现config文件的统一管理
brew "stow"
# Python 包与项目管理器
brew "uv"
# 基于 Rust 的终端文件管理器
brew "yazi"
# 智能 cd 跳转工具
brew "zoxide"
# 现代化 Shell 解释器
brew "zsh"
# 自动补全建议插件
brew "zsh-autosuggestions"
# 语法高亮插件
brew "zsh-syntax-highlighting"
cask "apifox"
# 用于在cli中大模型切换使用
cask "cc-switch"
# 大模型聊天工具
cask "cherry-studio"
# Anthropic 命令行 AI 助手
cask "claude-code"
# 临时使用数据库
cask "datagrip"
# 钉钉办公客户端
cask "dingtalk"
# 编程图标补丁字体
cask "font-jetbrains-mono-nerd-font"
# 实现豆包的语音输入接入
cask "hammerspoon"
# 压缩与解压缩工具
cask "keka"
# GPU 加速终端模拟器
cask "kitty"
# 知识管理与 Markdown 笔记
cask "obsidian"
# 轻量级容器与虚拟机管理
cask "orbstack"
# 截图/贴图/OCR 效率工具
cask "pixpin"
